cfd/legendSedanSpoiler_3_4/0.orig/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (17.5 0 0);
pressure             0;
turbulentKE          0.0459; // 3/2*(I*U)^2 -> sapere I del circuito 
turbulentOmega       0.6329; // KE^0.5/(L*C^0.25) -> L è la scala turbolenta (per i ponti è 1/3*B) e C è il model tuning coefficient, di solito 0.09 

// ************************************************************************* //
